Tekla.Structures.Drawing.PickerInput
The PickerInput class instances can be provided as predefined results of requests through the
methods of the UI.Picker class.

Tekla.Structures.Drawing.PickerInput.Type
The type of the picker input, identifying the most derived PickerInput class of this instance.

Tekla.Structures.Drawing.PickerInput.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.PickerInput class.

Tekla.Structures.Drawing.PickerInput.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.